// 百度地图API功能
    var map = new BMap.Map("allmap");
    var mk;
    map.centerAndZoom("杭州", 13);
    map.enableScrollWheelZoom();   //启用滚轮放大缩小，默认禁用
    map.enableContinuousZoom();    //启用地图惯性拖拽，默认禁用
    map.enableInertialDragging();


    //添加选择城市的控件
    var size = new BMap.Size(50, 20);
    map.addControl(new BMap.CityListControl({
        anchor: BMAP_ANCHOR_TOP_RIGHT,
        offset: size,
        // 切换城市之间事件
        // onChangeBefore: function(){
        //    alert('before');
        // },
        // 切换城市之后事件
        // onChangeAfter:function(){
        //   alert('after');
        // }
    }));
    //全国保时捷门店定位
    var data_info = [
        //杭州
        [120.2187900000,30.2054700000,
            `<h2>杭州滨江保时捷中心</h2>
		<h5>地址：滨江区月明路726号</h5>
		<h5>电话：+86 571 87777 911</h5>`
        ],
        [120.1602800000,30.2441800000,
            `<h2>杭州西湖保时捷中心</h2>
		<h5>地址：南山路218号-1号</h5>
		<h5>电话：+86 571 87088 911</h5>`
        ],
        [120.2137900000,30.3629630000,
            `<h2>杭州拱墅保时捷中心</h2>
		<h5>地址：拱墅区同协路 1699 号</h5>
		<h5>电话：+86 571 28999 911</h5>`
        ],
        //北京
        [116.41548,39.913826,
            `<h2>北京长安保时捷中心</h2>
		<h5>地址：东城区东长安街10号，长安俱乐部首层</h5>
		<h5>电话：+86 10 65211 911</h5>`
        ],
        [116.280789,39.936491,
            `<h2>北京海淀保时捷中心</h2>
		<h5>地址：海淀区西四环北路143号</h5>
		<h5>电话：+86 10 58739 911</h5>`
        ],
        [116.519219,39.816667,
            `<h2>北京亦庄保时捷中心</h2>
		<h5>地址：经济技术开发区东环北路甲1号 1699 号</h5>
		<h5>电话： +86 10 59659 911</h5>`
        ],
        [116.206076,39.924196,
            `<h2>北京石景山保时捷中心</h2>
		<h5>地址：石景山区时代花园南路36号 1699 号</h5>
		<h5>电话： +86 10 8898 1911</h5>`
        ],
        [116.569461,40.022999,
            `<h2>北京金港保时捷中心</h2>
		<h5>地址：朝阳区金盏乡东苇路北金港大道1号金港汽车公园C区8号甲1</h5>
		<h5>电话：+86 10 64309 911</h5>`
        ],
        //上海
        [121.476867,31.238166,
            `<h2>上海浦西保时捷中心</h2>
		<h5>地址：黄浦区南京西路288号，创兴金融中心首层</h5>
		<h5>电话： +86 21 23214 911</h5>`
        ],
        [121.536919,31.224154,
            `<h2>上海浦东保时捷中心</h2>
		<h5>地址：浦东新区东方路1215-1号首层</h5>
		<h5>电话： +86 21 61871 911</h5>`
        ],
        [121.63073,31.306423,
            `<h2>上海外高桥保时捷中心</h2>
		<h5>地址：外高桥俱进路1007号</h5>
		<h5>电话： +86 21 80172 911</h5>`
        ],
        [121.351632,31.148853,
            `<h2>上海闵行保时捷中心</h2>
		<h5>地址：闵行区中春路7358号</h5>
		<h5>电话： +86 21 5176 9911</h5>`
        ],
        //安徽合肥
        [117.3516000000,31.7973140000,
            `<h2>合肥保时捷中心</h2>
		<h5>地址：包河工业区长春街（原纬一路）49号</h5>
		<h5>电话：  +86 551 63663 911</h5>`
        ],
        //福建
        [119.3264100000,26.0544500000,
            `<h2>福州台江保时捷中心</h2>
		<h5>地址：台江区排尾路99号</h5>
		<h5>电话：+86 59187600 911</h5>`
        ],
        //泉州
        [118.4968500000,24.9172400000,
            `<h2>泉州保时捷中心</h2>
		<h5>地址：霞美镇四黄村</h5>
		<h5>电话： +86 595 86911 911</h5>`
        ],
        //闽江
        [119.3515500000,26.0202800000,
            `<h2>福州闽江保时捷中心</h2>
		<h5>地址：仓山区盖山投资区高仕路西侧</h5>
		<h5>电话： +86 591 87105 911</h5>`
        ],
        //广州
        [113.3887020000,23.1253010000,
            `<h2>广州天河保时捷中心</h2>
		<h5>地址：天河区中山大道西923号</h5>
		<h5>电话： +86 20 37199 911</h5>`
        ],
        [113.1776000000,23.0345800000,
            `<h2>佛山南海保时捷中心</h2>
		<h5>地址：南海区佛平四路雄峰车城 1 号</h5>
		<h5>电话： +86 757 81819 911</h5>`
        ],
        [113.3533200000,22.9916200000,
            `<h2>广州番禺保时捷中心</h2>
		<h5>地址：番禺区南村镇兴业大道 1 号</h5>
		<h5>电话： +86 20 39989 911</h5>`
        ],
        [113.2496200000,22.9437000000,
            `<h2>佛山顺德保时捷中心</h2>
		<h5>地址：顺德区北滘镇碧江G105国道聚龙沙3号（碧江加油站对面）</h5>
		<h5>电话： +86 0757 85911 911</h5>`
        ],
        //广西
        [108.2613100000,22.7752100000,
            `<h2>南宁保时捷中心</h2>
		<h5>地址：江南区南站大道11号</h5>
		<h5>电话：  +86 771 5898 911</h5>`
        ],
        //贵州
        [106.6108200000,26.6428000000,
            `<h2>贵阳保时捷中心</h2>
		<h5>地址：观山湖区迎宾西路金阳通源汽车文化广场</h5>
		<h5>电话：  +86 851 86860 911</h5>`
        ],
        //海南
        [106.3214800000,38.5404800000,
            `<h2>银川保时捷中心</h2>
		<h5>地址：贺兰德胜工业园区109 国道与永胜东路东北角</h5>
		<h5>电话：  +86 951 8822 911</h5>`
        ],
        //湖南
        [112.8933900000,28.3136900000,
            `<h2>长沙河西保时捷中心</h2>
		<h5>地址：望城区金星北路四段567号</h5>
		<h5>电话：  +86 731 88589 911</h5>`
        ],
        //河北
        [117.3792900000,39.1597600000,
            `<h2>天津空港保时捷中心</h2>
		<h5>地址：天津空港经济区汽车园中路59号</h5>
		<h5>电话：   +86 22 58919 911</h5>`
        ],
        [117.2637600000,38.9901400000,
            `<h2>天津西青保时捷中心</h2>
		<h5>地址：西青区津港公路 31 号</h5>
		<h5>电话：+86 22 58105 911</h5>`
        ],
        //江苏
        [119.9276800000,32.4434400000,
            `<h2>泰州凤凰保时捷中心</h2>
		<h5>地址：永定东路 188 号</h5>
		<h5>电话：+86 523 80806 666</h5>`
        ],
        //江西
        [115.9612300000,28.6982800000,
            `<h2>南昌保时捷中心</h2>
		<h5>地址：高新大道755号</h5>
		<h5>电话： +86 791 83811 911</h5>`
        ],
        //吉林
        [125.2055000000,43.8208000000,
            `<h2>长春保时捷中心</h2>
		<h5>地址：西新经济技术开发区长沈路4058号</h5>
		<h5>电话： +86 431 85980 911</h5>`
        ],
        //辽宁
        [123.4052200000,41.7251100000,
            `<h2>沈阳国展保时捷中心</h2>
		<h5>地址：浑南新区浑南西路 99 号</h5>
		<h5>电话：+86 024 31489 911</h5>`
        ],
        [123.3482500000,41.8163600000,
            `<h2>沈阳铁西保时捷中心</h2>
		<h5>地址：铁西区北二西路 21 号</h5>
		<h5>电话：  +86 24 25120 911</h5>`
        ],
        //山东
        [119.0065100000,36.7232800000,
            `<h2>潍坊保时捷中心</h2>
		<h5>地址：潍城区北宫西街9118号</h5>
		<h5>电话： +86 536 8399 911</h5>`
        ],
        [118.0439700000,36.7812100000,
            `<h2>淄博保时捷中心</h2>
		<h5>地址：张店区山泉路45号</h5>
		<h5>电话： +86 533 3119 911</h5>`
        ],
        //山西
        [112.6082700000,37.7734200000,
            `<h2>太原保时捷中心</h2>
		<h5>地址：小店区黄陵路56号</h5>
		<h5>电话：  +86 351 7979 911</h5>`
        ],
        //四川
        [104.0356900000,30.5934500000,
            `<h2>成都机场保时捷中心</h2>
		<h5>地址：高新区新园南三路86号</h5>
		<h5>电话： +86 28 85015 911</h5>`
        ],
        [103.9844100000,30.7175700000,
            `<h2>成都金牛保时捷中心</h2>
		<h5>地址：羊西线蜀西路173号成都国际汽车园</h5>
		<h5>电话： +86 28 87592 911</h5>`
        ],
        [104.1164100000,30.5880700000,
            `<h2>成都锦江保时捷中心</h2>
		<h5>地址：锦江区石胜路198汽车工业园</h5>
		<h5>电话：  +86 28 82800 911</h5>`
        ],


    ];
    var title = [
        "杭州","北京","上海"
    ]
    function opts() {
        return  {
            width : 290,     // 信息窗口宽度
            height: 105,     // 信息窗口高度
            //title : title , // 信息窗口标题
            enableMessage:true//设置允许信息窗发送短息

        };
    }


    for(var i=0;i<data_info.length;i++){
        var marker = new BMap.Marker(new BMap.Point(data_info[i][0],data_info[i][1]));  // 创建标注
        var content = data_info[i][2];
        map.addOverlay(marker);               // 将标注添加到地图中
        addClickHandler(content,marker);
    }
    function addClickHandler(content,marker){
        marker.addEventListener("click",function(e){
            openInfo(content,e)}
        );
    }
    function openInfo(content,e){
        var p = e.target;
        var point = new BMap.Point(p.getPosition().lng, p.getPosition().lat);
        var infoWindow = new BMap.InfoWindow(content,opts());  // 创建信息窗口对象
        map.openInfoWindow(infoWindow,point); //开启信息窗口
    }
    //单击获取点击的经纬度
    map.addEventListener("click", function (e) {
        //alert(e.point.lng + "," + e.point.lat);
        map.removeOverlay(mk);
        mk = new BMap.Marker(e.point);
        map.addOverlay(mk);
    });


    // 添加带有定位的导航控件
    var navigationControl = new BMap.NavigationControl({
        // 靠左上角位置
        anchor: BMAP_ANCHOR_TOP_LEFT,
        // LARGE类型
        type: BMAP_NAVIGATION_CONTROL_LARGE,
        // 启用显示定位
        enableGeolocation: true
    });
    map.addControl(navigationControl);
    // 添加定位控件
    var geolocationControl = new BMap.GeolocationControl();
    geolocationControl.addEventListener("locationSuccess", function (e) {
        // 定位成功事件
        var address = '';
        address += e.addressComponent.province;
        address += e.addressComponent.city;
        address += e.addressComponent.district;
        address += e.addressComponent.street;
        address += e.addressComponent.streetNumber;
        //alert("当前定位地址为：" + address);
    });
    geolocationControl.addEventListener("locationError", function (e) {
        // 定位失败事件
        alert(e.message);
    });
    map.addControl(geolocationControl);